const allQuestions = [
  [
    "هل تستمتع بقراءة الكتب؟",
    "هل تواجه صعوبة في التركيز؟",
    "هل تتضايق من الأماكن المزدحمة؟",
    "هل تفضل العزلة على الاجتماعات الاجتماعية؟",
    "هل تشعر بالحزن بدون سبب واضح؟",
    "هل تجد صعوبة في النوم ليلاً؟",
    "هل تتغير حالتك المزاجية بشكل مفاجئ؟",
    "هل تثق بالآخرين بسهولة؟",
    "هل تحس أن الناس يراقبونك؟",
    "هل تشعر بالتعب طوال اليوم؟"
  ],
  [
    "هل تخاف من المستقبل؟",
    "هل تتردد كثيراً قبل اتخاذ القرار؟",
    "هل تتوتر بسهولة؟",
    "هل تحس بأن لا أحد يفهمك؟",
    "هل تستيقظ متعبًا؟",
    "هل تعاني من صعوبات مالية تؤثر على مزاجك؟",
    "هل لديك أصدقاء مقربون؟",
    "هل شعرت مرة أنك غير مهم؟",
    "هل تستمتع بالخروج مع العائلة؟",
    "هل تعاني من وساوس معينة؟"
  ],
  [
    "هل تظن أن الآخرين يتحدثون عنك؟",
    "هل تشك في نوايا المقربين منك؟",
    "هل تحب التحكم في الأمور من حولك؟",
    "هل لديك أفكار سوداوية أحيانًا؟",
    "هل تحس أنك تفقد السيطرة؟",
    "هل لديك صعوبة في التعبير عن مشاعرك؟",
    "هل تحب أن تكون في موقع القيادة؟",
    "هل يزعجك النقد؟",
    "هل تشعر بالإحباط من الحياة؟",
    "هل تفكر بالماضي كثيرًا؟"
  ],
  [
    "هل تندم على قراراتك غالبًا؟",
    "هل تشعر أن الحظ ضدك؟",
    "هل تحب أن تكون لوحدك؟",
    "هل تتضايق من الضوضاء؟",
    "هل تستيقظ في منتصف الليل كثيرًا؟",
    "هل تتجنب الاتصال بالناس؟",
    "هل تنزعج من الأمور التافهة؟",
    "هل لديك نوبات بكاء؟",
    "هل تفقد اهتمامك بالأشياء بسرعة؟",
    "هل تقلق بشأن صحتك كثيرًا؟"
  ],
  [
    "هل تفكر كثيرًا قبل الكلام؟",
    "هل تخاف من الفشل؟",
    "هل تتعلق بالأشخاص بسرعة؟",
    "هل تشعر أن الآخرين لا يقدرونك؟",
    "هل تنزعج إذا لم يُنفذ رأيك؟",
    "هل تحب التنظيم الزائد؟",
    "هل تقلق من المستقبل؟",
    "هل تجد صعوبة في التركيز أثناء الحديث؟",
    "هل لديك تقلبات مزاجية؟",
    "هل تشعر بالفراغ الداخلي؟"
  ]
];

);
